{"title":"Video Corruption Filter","description":"This article is the 2nd article that is part of a larger thread (refer to image-filters.md)","slug":"image-filters-corrupt","html":"<link rel='stylesheet' href='post-res/image-filters-corrupt/style.css'>\n\n<h2 id=\"table-of-contents\">Table of Contents</h2>\n<ul>\n<li><a onclick=\"document.location.hash='introduction';\" href=\"javascript:;\">Introduction</a><ul>\n<li><a onclick=\"document.location.hash='what-is-glitch-art';\" href=\"javascript:;\">What is Glitch Art</a></li>\n</ul>\n</li>\n<li><a onclick=\"document.location.hash='corruption-method';\" href=\"javascript:;\">Corruption Method</a><ul>\n<li><a onclick=\"document.location.hash='utilizing-class-activation-map';\" href=\"javascript:;\">Utilizing Class Activation Map</a></li>\n<li><a onclick=\"document.location.hash='utilizing-reinforcement-learning';\" href=\"javascript:;\">Utilizing Reinforcement Learning</a><ul>\n<li><a onclick=\"document.location.hash='overview-of-q-learning';\" href=\"javascript:;\">Overview of Q-Learning</a></li>\n<li><a onclick=\"document.location.hash='implementing-q-learning';\" href=\"javascript:;\">Implementing Q-Learning</a></li>\n</ul>\n</li>\n<li><a onclick=\"document.location.hash='image-manipulation';\" href=\"javascript:;\">Image Manipulation</a></li>\n</ul>\n</li>\n<li><a onclick=\"document.location.hash='results';\" href=\"javascript:;\">Results</a></li>\n<li><a onclick=\"document.location.hash='caveats';\" href=\"javascript:;\">Caveats</a></li>\n<li><a onclick=\"document.location.hash='notes';\" href=\"javascript:;\">Notes</a></li>\n</ul>\n<h1 id=\"introduction\">Introduction</h1>\n<h2 id=\"what-is-glitch-art\">What is Glitch Art</h2>\n<p>With transferring, encoding, and processing electronic data, there has always been the issue of contending with data degradation. There are many methodologies in place to prevent and/or recover said corrupted data, but what is far more interesting to me is the intentional use of corruption on different kinds of mediums to produce something completely new. With corrupting visual mediums, this is usually referred to as <strong>glitch art</strong>.</p>\n<p>Referring to a great article written by <a target=\"_blank\" rel=\"nofollow\" href=\"https://nooart.org/post/73353953758/temkin-glitchhumancomputerinteraction\">Daniel Temkin in The Journal of Objectless Art</a>, glitch art &quot;mythologizes computer errors as its ultimate muse and tool&quot;. It utilizes the fact that the representation of data is neither &quot;good&quot; nor &quot;bad&quot; to the computer. Rather, Temkin asserts that &quot;the data is &#39;bad&#39; only to us [when] we have an expectation of representational imagery&quot;. With this divide between algorithmic data-processing and human abstraction, there lies the central components of glitch art aesthetic. Another important point that Temkin makes is that glitch art exists in a space between an unpredictable glitchable &quot;method&quot; (take for example traditional <a target=\"_blank\" rel=\"nofollow\" href=\"http://datamoshing.com/2016/06/26/how-to-datamosh-videos/\">datamoshing</a>) and a highly-controlled image processing technique (for example the Sepia Instagram filter).</p>\n<p>With the semantics of glitch art laid out for us, this post attempts to create a new method of corrupting images based on Temkin&#39;s aforementioned glitch art &quot;space&quot;.</p>\n<figure>\n<img src=\"post-res/image-filters-corrupt/bill_gates_example1.jpeg\" width=\"500\" alt=\"Image shown\"/>\n<figcaption><b>Fig. 1</b> - This is an example of glitch art applied to a single image. Credit to <a href=\"https://twitter.com/GlitchArtBot/status/1296534754494484486\">\"Glitch Art Bot\"</a> on Twitter</figcaption>\n</figure>\n\n<figure>\n<video style=\"display:block; margin: 0 auto;\" autoplay muted loop height=\"500\">\n    <source src=\"post-res/image-filters-corrupt/corrupt_1_video.mp4\" type=\"video/mp4\">\n    Your browser does not support the video tag.\n</video>\n<figcaption><b>Fig. 2</b> - This is an example of glitch art (or specifically pixel sorting) applied progressively to a video. Credit to JYP Entertainment's music video of <a href=\"https://www.youtube.com/watch?v=kOHB85vDuow\">FANCY</a> by TWICE.</figcaption>\n</figure>\n\n<h1 id=\"corruption-method\">Corruption Method</h1>\n<p>To create this new corruption method, the method must first be controllable to an extent by the end-user whilst retaining a recognizable glitch art &quot;aesthetic&quot; by being unpredictable in the corruption techniques and localization.</p>\n<p>In the case of predictability for the end-user, the method that was ultimately created allows for &quot;layering&quot; corruption methods on top of each other, as well as adjusting parameters related to the frequency of the corruption technique.</p>\n<p>In terms of unpredictability, I utilize Convolutional Neural Networks (CNNs) to be able to take into account the composition of the image and generate an array of &quot;agents&quot;, which conduct the actual degradation of certain parts of an image or frame. I associate CNNs with unpredictability because of the fact that they can, at times, utilize features from images that we do not necessarily identify or find useful. Because of this, the image composition projected by the CNN-related mechanism is not something always anticipated by humans. Additionally, the mechanism behind the &quot;agents&quot; feed from the output of the CNN in order to find their own &quot;path&quot; through an image.</p>\n<figure>\n<img src=\"post-res/image-filters-corrupt/corruption_diagram_1.png\" width=\"700\" alt=\"Image shown\"/>\n<img src=\"post-res/image-filters-corrupt/corruption_diagram_2.png\" width=\"700\" alt=\"Image shown\"/>\n<figcaption><b>Fig. 3</b> - Generalized structure of the method is split into two main section - \"training\" and \"application\". The training section consists of a Q-Learning algorithm to generate a state-action table. Q-Learning requires a reward space, action space, and environment. The environment was limited to a simple grid, and the action space was created by combining directional actions with a set of image manipulation techniques. The reward space was created by utilizing Class Activation Map (CAM) on ResNet18 to generate an activation map. With the activation map and post-processing noise for reward differentiation, I was able to run the Q-Learning algorithm to produce a state-action table. In the application section, I generate a random assortment of agents in different positions across an image and filtered them with a CAM-based mask. Then, the agents follow the policy and implement the image manipulation function. The agents are limited to a variable lifespan (initially set at 20).</figcaption>\n</figure>\n\n<h2 id=\"utilizing-class-activation-map\">Utilizing Class Activation Map</h2>\n<p>In this context, finding the composition of a given picture or frame was defined as the main subjects and object within an image. Based on this, the composition of an image is generated from a method called <em>Class Activation Map</em> (CAM). This method was first defined by <a target=\"_blank\" rel=\"nofollow\" href=\"http://cnnlocalization.csail.mit.edu/Zhou_Learning_Deep_Features_CVPR_2016_paper.pdf\">&quot;Learning Deep Features for Discriminative Localization&quot;</a> by Zhou et. al and aims to visualize the activations of a given network in order to do tasks such as weakly-supervised object localization (or detection). In summary, the activations can be generated by taking the feature maps from the last convolutional layer within the original network. The weighted sum of these feature maps are used to generate a final activation map output. Additionally, these weights are computed based on the parameter values of a softmax layer.</p>\n<figure>\n<img src=\"post-res/image-filters-corrupt/class_map_activation_diagram.png\" width=\"700\" alt=\"Image shown\"/>\n<figcaption><b>Fig. 4</b> - This is a diagram that represents the overall process regarding class activation mapping. Credit to the <a href=\"http://cnnlocalization.csail.mit.edu/Zhou_Learning_Deep_Features_CVPR_2016_paper.pdf\">original paper</a> for this diagram.</figcaption>\n</figure>\n\n<p>I implemented CAM with <strong>ResNet18</strong>, the slimmer sibling of a popular CNN feature extractor called ResNet50, because I wanted a coarser output for my activation map. The implementation details will be in the <code>CAM.py</code> python file, but I closely followed the original paper&#39;s code. Although, there are some exceptions to this as I changed the preprocessing to include &quot;padding&quot; of the input image in order to preserve the aspect ratio as well as other small modifications to streamline and update the code to PyTorch 1.17. The end result was an activation map that showed the areas that the neural network used to identify a given class or category. The method defined in Figure 3 ultimately used this activation map to help implement a reinforcement learning method for the actual degradation.</p>\n<h2 id=\"utilizing-reinforcement-learning\">Utilizing Reinforcement Learning</h2>\n<h3 id=\"overview-of-q-learning\">Overview of Q-Learning</h3>\n<p>Referring back Temkin, there must be a level of randomness and unpredictability when it comes to glitch art. Another important type of unpredictability in this context would be the &quot;self-autonomy&quot; of the computer in deciding what occurs within certain areas of the image. Although computers do not possess true &quot;self-autonomy&quot;, I can use the activation map output from the CAM section in order to provide a type of input disconnect between the computer and the end-user. That is to say, even though we have some control over how the computer will conduct itself on the image, it will be &quot;figuring out&quot; the actual degradation.</p>\n<p>This idea is implemented with reinforcement learning, which is a method of training an agent in a given environment in order to maximize and increase the efficiency for some type of goal. The agent can be described as an entity that can take an action and store its current state(s) from the environment. The training method can occur via many different types of methods, but the main cycle of interaction occurs as the following:</p>\n<ul>\n<li>The agent takes an acceptable action within the environment</li>\n<li>The environment sets a new state for the agent and hands a form of a reward to the agent</li>\n<li>The agent updates its internal method of determining its actions with the environment feedback</li>\n</ul>\n<p>With this cycle, the hope is to have the agent converge to the optimal action given the state it is in. In terms of this project, the reinforcement learning problem is a simple <a target=\"_blank\" rel=\"nofollow\" href=\"https://towardsdatascience.com/reinforcement-learning-implement-grid-world-from-scratch-c5963765ebff\">Grid World</a> problem where the agent needs to find the optimal path out of the image and/or maximize its reward while in the environment.</p>\n<p>With a general idea behind reinforcement learning established, let&#39;s discuss the method that I used to help the agents in my reinforcement learning problem determine its set of optimal actions. The algorithm used is vanilla Q-Learning, which consists of the agent taking the maximum value of all of the possible actions within a given state. In theory, the values associated to each action within a state should correlate with their relative positive or negative impact on the agent&#39;s returns.</p>\n<p>This aforementioned &quot;value&quot; assigned to each state-action pair is determined during the &quot;training&quot; portion of Q-Learning, where an agent runs through multiple episodes (which are series of action, reward, new state tuples created by the agent-environment interaction until the agent reaches a terminal state). During each step of the episode, the Q-Learning algorithm updates the value of a given state-action pair based on the reward given by being in that state. With the state-action table being updated at every episode iteration, there will be a convergence to where the action with the largest value at a given state will yield the highest reward.</p>\n<figure>\n<img src=\"post-res/image-filters-corrupt/q-learning.png\" width=\"800px\" alt=\"Image shows the algorithm behind the training portion of Q-Learning.\"/>\n<figcaption><b>Fig. 5</b> - This is the algorithm for generating a state-action table (denoted as $Q(s,a)$) with Q-learning. $\\alpha$ and $\\gamma$ can be considered hyperparameters, with the former representing the learning rate and the latter representing the <a href=\"https://stats.stackexchange.com/a/221472\">discount factor</a></figcaption>\n</figure>\n\n<h3 id=\"implementing-q-learning\">Implementing Q-Learning</h3>\n<p>For my environment, using a tabular Q-learning method will require creating a state-action table that is $m \\times n \\times a$, where $m$ is the height of the grid, $n$ is the width of the grid, and $a$ is the number of actions in the action space. The action space was created by taking the standard movement actions (up, down, etc.) and enumerating it with a list of image manipulation methods (pixel averaging, desaturation, inverted colors, etc.). For the reward space, I took the activation map generated in the CAM section, invert the values (sometimes), and create an array that is the length of $a$ to correspond with the action space. Additionally, each element in the reward space was summed with a gaussian noise matrix and processed with a median filter to differentiate themselves from the other reward elements. This also allowed the end-user to control the importance of an image-manipulation action by decreasing and increasing the noise distribution parameters on a given method. Finally, the policy derived from the initial &quot;training&quot; portion of Q-learning was a simple $\\epsilon$-greedy policy, where there was an $\\epsilon$ percent chance of a random action happening and $1-\\epsilon$ percent chance of the current optimal action happening. This is done to promote exploration, which is <strong>key</strong> for the first set of iterations. If the policy was only greedy (aka just taking the action associated with maximum value within a given state), it would, in most cases, not yield a true optimal convergence.</p>\n<figure>\n<img src=\"post-res/image-filters-corrupt/q_learn_chart_example1.png\" width=\"800\" alt=\"Image shows the algorithm behind the training portion of Q-Learning.\"/>\n<figcaption><b>Fig. 6</b> - To illustrate how well a certain configuration of the Q-Learning algorithm is faring, I graphed the \"raw\" returns per iteration and the running average of returns per iteration. In this example, you can see there's an initial, sharp learning period followed by a plateau, which can indicate that the state-action table has reached near optimality.</figcaption>\n</figure>\n\n<p>As for the grid itself, it does not have to correspond directly with the height and width of the input image or frame. Rather, the grid must maintain a dimension that&#39;s ratio is equal to or greater than the image&#39;s ratio. The reasoning is based on the fact that image ratios vary widely and having to match a grid ratio with the image ratio would severely limit the level of artistic control. Additionally, if the grid&#39;s ratio was larger than the image&#39;s ratio, the reward space elements could simply be resized with the image ratio and padded with a prohibitory reward value to later fit the grid dimensions. With this prohibitory value, the agents can simply ignore the areas in the grid that do not correspond with the image.</p>\n<figure>\n<img src=\"post-res/image-filters-corrupt/reward_space_example.png\" width=\"800\" alt=\"quick illustration of the reward space containing padding that is filled with 'prohibitory' reward values\"/>\n<figcaption><b>Fig. 7</b> - This is a quick illustration of the reward space containing padding that is filled with \"prohibitory\" reward values (in other words, making sure the padding values are the absolute minima in the matrices)</figcaption>\n</figure>\n\n<h2 id=\"image-manipulation\">Image Manipulation</h2>\n<p>In the previous section, I discussed image manipulation methods as a factor in the creation of the action space. This section will discuss the details of the image manipulation methods.</p>\n<p>The most basic type of image-based corrupt is the &quot;artifact&quot;, which is where image format algorithms (JPEG, PNG, etc.) force the reduction of an image&#39;s size by simplifying the range of color values within a <strong>block</strong> of the image. As the quality decreases, these blocking artifacts become more and more noticable as the average color range in a given block removes enough visual features from that block.</p>\n<p>In a similar vein, I adopted a simple pixelization method (color averaging in a given block of an image corresponding to a space in the grid) as my first image manipulation method. Although, I realized quickly that pixelization can really only be applied effectively in situations where the grid is quite big (i.e. when the block size is quite small). This is because larger pixelizations do not aesthetically match the type of glitch art presented in the introduction.</p>\n<p>Another type of image manipulation used was desaturation. There are many types of desaturation methods, but the one I used was based on the luminance ( $0.3(r) + 0.59(g) + 0.11(b)$ ). Similar to pixelization, desaturation was reserved for specific grid block sizes, but unlike pixelization, desaturation was mostly unnoticable in smaller grid blocks unless the image had high saturation. Because of this, desaturation was used more frequently in grids with larger blocks. </p>\n<p>Finally, there are two more image manipulation methods called &quot;invert&quot; and &quot;random&quot;. The former is simply the inverted color of a grid block after it has been run through pixelization. The inversion is done via $|\\text{COLOR_CHANNEL}-255|$. &quot;Random&quot; is simply a randomized color assigned to the grid block after pixelization. Both of these methods are utilized in the same way pixelization is used (i.e. in grids with small block sizes).</p>\n<h1 id=\"results\">Results</h1>\n<p>Here are some results utilizing the method described in Figure 4.</p>\n<figure>\n<video style=\"display:block; margin: 0 auto;\" autoplay muted loop width=\"260px\">\n  <source src=\"post-res/image-filters-corrupt/example1.mp4\" type=\"video/mp4\">\n  Your browser does not support the video tag.\n</video>\n<figcaption>\n  <table class=\"layer-setup\" style=\"margin: 0 auto; width: 260px\">\n    <tr>\n      <th>Layer</th>\n      <th>Size</th>\n      <th>Iterations</th>\n    </tr>\n    <tr class=\"tbody\"><td>1</td><td>(20,10)</td><td>10,000</td></tr>\n    <tr class=\"tbody\"><td>2</td><td>(40,20)</td><td>100,000</td></tr>\n    <tr class=\"tbody\"><td>3</td><td>(200,100)</td><td>10,000</td></tr>\n    <tr>\n      <th>Agents</th>\n      <th>Preserve</th>\n      <th>Repeat Agents</th>\n    </tr>\n    <tr class=\"tbody\"><td>200</td><td>False</td><td>True</td></tr>\n    <tr class=\"tbody\"><td>800</td><td>True</td><td>False</td></tr>\n    <tr class=\"tbody\"><td>20,000</td><td>True</td><td>False</td></tr>\n  </table>\n  </figcaption>\n</figure>\n\n<figure>\n<img style=\"display:block; margin: 0 auto;\" src=\"post-res/image-filters-corrupt/test2_output.png\" width=\"260px\"/>\n<figcaption>\n    <table class=\"layer-setup\" style=\"margin: 0 auto; width: 260px\">\n      <tr>\n        <th>Layer</th>\n        <th>Size</th>\n        <th>Iterations</th>\n      </tr>\n      <tr class=\"tbody\"><td>1</td><td>(200,100)</td><td>10,000</td></tr>\n      <tr>\n        <th>Agents</th>\n        <th>Preserve</th>\n        <th>Repeat Agents</th>\n      </tr>\n      <tr class=\"tbody\"><td>10000</td><td>N/A</td><td>False</td></tr>\n    </table>\n  </figcaption>\n</figure>\n\n<figure>\n<video autoplay muted loop width=\"260px\" style=\"display:block; margin: 0 auto;\" >\n        <source src=\"post-res/image-filters-corrupt/example2.mp4\" type=\"video/mp4\">\n        Your browser does not support the video tag.\n      </video>\n<figcaption>\n<table class=\"layer-setup\" style=\"margin: 0 auto; width: 260px\">\n        <tr>\n          <th>Layer</th>\n          <th>Size</th>\n          <th>Iterations</th>\n        </tr>\n          <tr class=\"tbody\"><td>1</td><td>(200,100)</td><td>10,000</td></tr>\n          <tr class=\"tbody\"><td>2</td><td>(40,20)</td><td>100,000</td></tr>\n          <tr class=\"tbody\"><td>3</td><td>(200,100)</td><td>10,000</td></tr>\n        <tr>\n          <th>Agents</th>\n          <th>Preserve</th>\n          <th>Repeat Agents</th>\n        </tr>\n        <tr class=\"tbody\"><td>20,000</td><td>False</td><td>False</td></tr>\n        <tr class=\"tbody\"><td>800</td><td>True</td><td>False</td></tr>\n        <tr class=\"tbody\"><td>20,000</td><td>True</td><td>False</td></tr>\n      </table>\n</figcaption>\n</figure>\n\n<figure>\n<img src=\"post-res/image-filters-corrupt/test3_output.png\" width=\"260px\" style=\"display:block; margin: 0 auto;\"/> \n<figcaption>\n  <table class=\"layer-setup\" style=\"margin: 0 auto; width: 260px\">\n    <tr>\n      <th>Layer</th>\n      <th>Size</th>\n      <th>Iterations</th>\n    </tr>\n    <tr class=\"tbody\"><td>1</td><td>(40,20)</td><td>100,000</td></tr>\n    <tr class=\"tbody\"><td>2</td><td>(200,100)</td><td>10,000</td></tr>\n    <tr>\n      <th>Agents</th>\n      <th>Preserve</th>\n      <th>Repeat Agents</th>\n    </tr>\n    <tr class=\"tbody\"><td>800</td><td>N/A</td><td>False</td></tr>\n    <tr class=\"tbody\"><td>22,730</td><td>N/A</td><td>False</td></tr>\n  </table>\n</figcaption>\n</figure> \n\n<h1 id=\"caveats\">Caveats</h1>\n<ul>\n<li>There is still some issues related to Q-Learning not learning the true optimal path, but it does not seem to effect over aesthetic matching.</li>\n<li>The stochastic nature of the reward space and $\\epsilon$-greedy policy of the &quot;training&quot; portion of Q-Learning will lead to slight changes between runs of the same parameters and image.</li>\n</ul>\n<h1 id=\"notes\">Notes</h1>\n<p><strong>[1]</strong> - Performance is currently dependent on the number of iterations for the Q-learning, the number of agents, and the lifetime of the agents.</p>\n<p><strong>[2]</strong> - Some performance increases can be increased by storing the Q-tables for that given image/video for quicker editing of the layers.</p>\n<p><strong>[3]</strong> - Source code will be published soon. I still need to clean up the code.</p>\n<p><strong>[4]</strong> - <strong>Sources for images shown in Results section:</strong></p>\n<ul>\n<li>[<a target=\"_blank\" rel=\"nofollow\" href=\"https://www.pexels.com/video/4903224/\">1st</a> and <a target=\"_blank\" rel=\"nofollow\" href=\"https://www.pexels.com/video/5645774/\">3rd</a>] - cottonbro</li>\n<li>[<a target=\"_blank\" rel=\"nofollow\" href=\"https://www.pexels.com/photo/semi-opened-laptop-computer-turned-on-on-table-2047905/\">2nd</a>] - Junior Teixeria </li>\n<li>[<a target=\"_blank\" rel=\"nofollow\" href=\"https://www.pexels.com/photo/woman-sitting-on-a-sofa-chair-in-a-room-2774197/\">4th</a>] - CREATIVE HUSSAIN</li>\n</ul>\n","created":"Sun, 28 Feb 1999 19:45:28 GMT","excerpt":"","author":"Vijay Rajagopal","readingTime":"14 min read","mediaFilePath":"post-res/image-filters-corrupt/image-filters-corrupt_thumb.mp4","tags":["art","topic"],"art_credit":"Vijay Rajagopal"}