{"title":"SiamMask ONNX Export Journey","description":"Blog post going over exporting one kind of SiamMask model into ONNX","slug":"siammask_onnx_export","html":"<p>During my masters thesis, I worked on different multiple object tracking (MOT) methods. There is another type of tracking method, single object tracking (SOT), that I always was interested in but never got the chance to try. One such SOT method is called SiamMask, and this blog post will go over how I exported this network to ONNX.</p>\n<h1 id=\"single-object-tracking-overview\">Single Object Tracking Overview</h1>\n<p>Single Object Tracking (SOT) is a pretty straight-forward task. A defined ROI is given to the SOT method, and the method attempts to propogate the location of the object within the defined ROI for the next <strong>n</strong> frames. Typically, SOT ROIs are bounding boxes (similar to MOT), but SOT can be extended to other localization types, such as segmentation masks or poses. With the advances in Deep Learning, SOT methods have increasingly relied on deep neural networks in order to derive useful features and information from task-aligned frames.</p>\n<figure>\n<img src=\"./post-res/siammask_onnx_export/sot_example.png\", alt=\"Example of different Single Object Tracking tasks - Taken from Do Different Tracking Tasks Require Different Appearance Models? by Wang et. al\", style=\"margin-right:auto; margin-left:auto; max-width:400px\"/>\n<figcaption><b>Fig. 1</b> - An example of different Single Object Tracking sub-tasks. Taken from <a href=\"https://arxiv.org/pdf/2107.02156.pdf\">here</a> </figcaption>\n</figure>\n\n\n<h1 id=\"siammask-paper-overview\">SiamMask Paper Overview</h1>\n<p>SiamMask mainly follows in the footsteps of two different Siamese-based SOT methods: SiamFC and SiamRPN. SiamFC was one of the first real-time Siamese-based SOT methods and follows a very simple system for generating bounding boxes. A feature extraction network (ex: ResNet, MobileNet, etc.) takes in the user-defined RoI (typically called the &quot;exemplar&quot; input) and generates a feature map that can be used in the preceding frames (typically called &quot;search&quot; inputs). <strong>The exemplar input is also often smaller than the search inputs</strong> as to conserve speed and reduce features to their most important aspects. When SiamFC ingests a search input, it takes a cross-correlation between the search and the exemplar input. This cross-correlation generates a feature map that can be used to generate bounding boxes at each spatial location. <strong>The output of the cross-correlation operation is also referred to as the &quot;Response of a Candidate Window&quot; (RoW).</strong> SiamFC&#39;s main loss objective was logistic regression.</p>\n<figure>\n<img src=\"./post-res/siammask_onnx_export/siamfc_diagram.png\", alt=\"Diagram of general network flow from original SiamFC paper\", style=\"margin-right:auto; margin-left:auto; max-width:700px\"/>\n<figcaption><b>Fig. 2</b> - Network flow of SiamFC showing how the subject in the search input can be correlated in the final feature map. Taken from <a href=\"https://arxiv.org/pdf/1606.09549.pdf\">here</a> </figcaption>\n</figure>\n\n\n<p>SiamRPN extends SiamFC by incorporating a traditional <strong>Regional Proposal Network (RPN) to help guide the RoW and generate more descriptive features.</strong> In implementation, the RPN actually generates two different RoWs for their respective prediction branches (bounding box regression prediction and classification prediction). Each channel within the bounding box-related RoW encodes RPN data (anchors and bounding box confidence score). This robustifies not only the bounding boxes but also the implicit similarity matching. SiamRPN trains with L1 smooth loss (bounding box) and cross-entropy loss (classification score).</p>\n<figure>\n<img src=\"./post-res/siammask_onnx_export/siamrpn_diagram.png\", alt=\"Diagram of general network flow from original SiamRPN paper\", style=\"margin-right:auto; margin-left:auto; max-width:900px\"/>\n<figcaption><b>Fig. 3</b> - Network flow of SiamRPN showing the RPN and two branch approach to assist with bounding box prediction. Taken from <a href=\"https://openaccess.thecvf.com/content_cvpr_2018/papers/Li_High_Performance_Visual_CVPR_2018_paper.pdf\">here</a> </figcaption>\n</figure>\n\n\n<p>Finally, SiamMask considers utilizing <strong>segmentation as an additional method in increasing the descriptiveness of the RoW features</strong> but without a computationally expensive RPN. RoW generation occurs similar to SiamFC, but instead of cross correlation, SiamMask utilizes depth-wise (channel-wise) correlation. Like SiamRPN, prediction outputs are separated into their respective branches. SiamMask has &quot;bounding box&quot;, &quot;segmentation&quot;, and &quot;score&quot; branches with their own shallow sub-networks. SiamMask trains with a multi-objective loss function that combines SiamRPN&#39;s L1 smooth (bounding box branch) and cross-entropy loss (score branch) with binary logistic regression (segmentation branch). Each part of the multi-objective loss function is weighted by a scalar lambda. The paper mentions that they just guessed some good numbers, where the mask lambda was 32 and the other lambdas were 1. SiamMask also comes in a two-branch variant, where the bounding box branch is removed.</p>\n<figure>\n<img src=\"./post-res/siammask_onnx_export/siammask_diagram.jpeg\", alt=\"Diagram showing the network flow of SiamMask (taken from original paper)\", style=\"margin-right:auto; margin-left:auto; max-width:700px\"/>\n<figcaption><b>Fig. 4</b> - Network flow of SiamMask showing a three-branched approach with a focus on the segmentation output. Taken from <a href=\"https://arxiv.org/pdf/1812.05050.pdf\">here</a> </figcaption>\n</figure>\n\n\n<h1 id=\"onnx-process\">ONNX Process</h1>\n<mark>\nHere is the isolated code for exporting SiamMask as an ONNX model: <a href=https://github.com/vjsrinivas/siammask_onnx>Link</a>\n</mark>\n\n<p><strong>Please note that this only allows for the default VOT configuration with the Mask Refinement module.</strong> You can probably adapt this process to work for other versions of SiamMask.</p>\n<p>Here is the bullet point summary of my PyTorch to ONNX process:</p>\n<ul>\n<li>I utilize the PyTorch <code>torch.onnx.export</code> function but, because of the conditional nature of the network, have to recreate the PyTorch model with Torchscript<ul>\n<li>This means rewriting some of the code to remove most, if not all, Python primitives</li>\n<li>With a Torchscript model, we are &quot;scripting&quot; (transcompiling into C) rather than the traditional &quot;tracing&quot; (JIT-based) method</li>\n</ul>\n</li>\n<li>During the first frame (n = 0), there is an initialization function that takes in the downsampled input and processes it through the feature extractor<ul>\n<li>Some unnotable preprocessing specifically for the n=0 state (this is NOT included in the ONNX model and is assumed to be done outside of the model)</li>\n</ul>\n</li>\n<li>For proceeding frames (n &gt; 0), we forward through the entirety of the network (feature extractor, segmentation branch, bounding box branch, and refinement module) and produce a mask.<ul>\n<li>Some additional post-processing steps to reproject the mask from the input (254x254) to the original image</li>\n</ul>\n</li>\n<li>Because of the conditional nature of the network, we need to take advantage of the <code>If</code> ONNX operator, which will allow us to switch between the n=0 and n&gt;0 states within ONNX<ul>\n<li>To make this model more robust to other inference engines (ex: TensorRT), we need to ensure that the output and input shapes and datatypes are the same among both conditional branches</li>\n<li>The above point comes into conflict with the original PyTorch implementation, where the n=0 state has a 127x127 input</li>\n<li>I work around this by requiring both branches have an input of 254x254, but in n=0 pre-processing, I create a blank image and fill the upper quadrant with the 127x127 input. In the n=0 state, ONNX will trim that 254x254 image input into 127x127</li>\n</ul>\n</li>\n<li>The return package of the model is counter-intuitive, but here is a rundown of them:<ul>\n<li>Feature maps from the n=0 state<ul>\n<li>It needs to be used repeatedly in n&gt;0 states to satisfy the identical return requirement</li>\n</ul>\n</li>\n<li>Deltas<ul>\n<li>Not used in n=0 but used in n&gt;0 for propogating the ROI for each frame in n&gt;0 states</li>\n</ul>\n</li>\n<li>Center position of bounding box<ul>\n<li>Used in calculation of every new propagation</li>\n</ul>\n</li>\n<li>Size of Bounding Box<ul>\n<li>Used in calculation of every new propagation</li>\n</ul>\n</li>\n<li>Mask<ul>\n<li>Self explainatory (a zero matrix for n=0 state)</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n<h2 id=\"result-examples\">Result Examples</h2>\n<video controls muted loop autoplay>\n  <source src=\"./post-res/siammask_onnx_export/car_example-converted.mp4\" type=\"video/mp4\">\n</video>\n\n<video controls muted loop autoplay>\n  <source src=\"./post-res/siammask_onnx_export/tennis_example-converted.mp4\" type=\"video/mp4\">\n</video>\n","created":"Mon, 11 Sep 2023 10:20:28 GMT","excerpt":"During my masters thesis, I worked on different multiple object tracking (MOT) methods. There is another type of tracking method, single object tracking (SOT), that I always was interested in but never got the chance to try. One such SOT method is called SiamMask, and this blog post will go over how I exported this network to ONNX.\n","author":"Vijay Rajagopal","readingTime":"6 min read","mediaFilePath":"post-res/siammask_onnx_export/siammask_onnx_export_thumb.mp4","tags":["machine learning"],"art_credit":"Vijay Rajagopal"}